> ### EEE3314: Introduction to Artificial Intelligence

# Intro to Pandas

Useful link: https://pandas.pydata.org/pandas-docs/stable/10min.html

In [2]:
import pandas as pd

In [3]:
index_list = ['MIT', 'Stanford', 'Harvard', 'Caltech', 'Cambridge', 'Oxford', 'UCL']

In [4]:
a = pd.Series([100, 98.7, 98.4, 97.9, 95.6, 95.3, 94.6], index = index_list)

In [5]:
print(a)

MIT          100.0
Stanford      98.7
Harvard       98.4
Caltech       97.9
Cambridge     95.6
Oxford        95.3
UCL           94.6
dtype: float64

In [6]:
print(a.index)

Index(['MIT', 'Stanford', 'Harvard', 'Caltech', 'Cambridge', 'Oxford', 'UCL'], dtype='object')

In [7]:
print(a[1])

98.7

In [8]:
print(a['Cambridge'])

95.6

In [9]:
b = a * 2

In [10]:
c = a ** 1.5

In [11]:
print(b)

MIT          200.0
Stanford     197.4
Harvard      196.8
Caltech      195.8
Cambridge    191.2
Oxford       190.6
UCL          189.2
dtype: float64

In [12]:
print(c)

MIT          1000.000000
Stanford      980.563513
Harvard       976.096258
Caltech       968.665958
Cambridge     934.731414
Oxford        930.334981
UCL           920.103546
dtype: float64

In [13]:
s = pd.Series(['random', 1.2, 3, 'data'], index = ['any', 'thing', 2, '4.3'])

In [14]:
print(s)

any      random
thing       1.2
2             3
4.3        data
dtype: object

In [15]:
index_list = ['MIT', 'Stanford', 'Harvard', 'Caltech', 'Cambridge']

In [16]:
u = {
    'citations': pd.Series([99.9, 99.4, 99.9, 100, 78.4], index = index_list),
    'employer': pd.Series([100, 100, 100, 85.4, 100], index = index_list)
}

In [17]:
df = pd.DataFrame(u)

In [18]:
df

           citations  employer
MIT             99.9     100.0
Stanford        99.4     100.0
Harvard         99.9     100.0
Caltech        100.0      85.4
Cambridge       78.4     100.0

In [19]:
print(df.index)

Index(['MIT', 'Stanford', 'Harvard', 'Caltech', 'Cambridge'], dtype='object')

In [20]:
print(df.columns)

Index(['citations', 'employer'], dtype='object')

In [21]:
l = [{'orange': 32, 'apple': 42}, {'banana':25, 'carrot': 44, 'apple': 34}]

In [22]:
df = pd.DataFrame(l, index = ['value1', 'value2'])

In [23]:
df

        orange  apple  banana  carrot
value1    32.0     42     NaN     NaN
value2     NaN     34    25.0    44.0

In [24]:
df = pd.read_csv('happiness.csv')

In [25]:
print(df.shape)

(149, 20)

In [26]:
df.head(10)

,Country name,Regional indicator,Ladder score,Standard error of ladder score,upperwhisker,lowerwhisker,Logged GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption,Ladder score in Dystopia,Explained by: Log GDP per capita,Explained by: Social support,Explained by: Healthy life expectancy,Explained by: Freedom to make life choices,Explained by: Generosity,Explained by: Perceptions of corruption,Dystopia + residual
0,Finland,Western Europe,7.842,0.032,7.904,7.780,10.775,0.954,72.0,0.949,-0.098,0.186,2.43,1.446,1.106,0.741,0.691,0.124,0.481,3.253
1,Denmark,Western Europe,7.620,0.035,7.687,7.552,10.933,0.954,72.7,0.946,0.030,0.179,2.43,1.502,1.108,0.763,0.686,0.208,0.485,2.868
2,Switzerland,Western Europe,7.571,0.036,7.643,7.500,11.117,0.942,74.4,0.919,0.025,0.292,2.43,1.566,1.079,0.816,0.653,0.204,0.413,2.839
3,Iceland,Western Europe,7.554,0.059,7.670,7.438,10.878,0.983,73.0,0.955,0.160,0.673,2.43,1.482,1.172,0.772,0.698,0.293,0.170,2.967
4,Netherlands,Western Europe,7.464,0.027,7.518,7.410,10.932,0.942,72.4,0.913,0.175,0.338,2.43,1.501,1.079,0.753,0.647,0.302,0.384,2.798
5,Norway,Western Europe,7.392,0.035,7.462,7.323,11.053,0.954,73.3,0.960,0.093,0.270,2.43,1.543,1.108,0.782,0.703,0.249,0.427,2.580
6,Sweden,Western Europe,7.363,0.036,7.433,7.293,10.867,0.934,72.7,0.945,0.086,0.237,2.43,1.478,1.062,0.763,0.685,0.244,0.448,2.683
7,Luxembourg,Western Europe,7.324,0.037,7.396,7.252,11.647,0.908,72.6,0.907,-0.034,0.386,2.43,1.751,1.003,0.760,0.639,0.166,0.353,2.653
8,New Zealand,North America and ANZ,7.277,0.040,7.355,7.198,10.643,0.948,73.4,0.929,0.134,0.242,2.43,1.400,1.094,0.785,0.665,0.276,0.445,2.612
9,Austria,Western Europe,7.268,0.036,7.337,7.198,10.906,0.934,73.3,0.908,0.042,0.481,2.43,1.492,1.062,0.782,0.640,0.215,0.292,2.784

In [27]:
index_list = ['MIT', 'Stanford', 'Harvard', 'Caltech', 'Cambridge']

In [28]:
u = {
    'citations': pd.Series([99.9, 99.4, 99.9, 100, 78.4], index = index_list),
    'employer': pd.Series([100, 100, 100, 85.4, 100], index = index_list)
}

In [29]:
df = pd.DataFrame(u)

In [30]:
df['score'] = (2* df['citations'] + 3 * df['employer'])/5

In [31]:
df

           citations  employer  score
MIT             99.9     100.0  99.96
Stanford        99.4     100.0  99.76
Harvard         99.9     100.0  99.96
Caltech        100.0      85.4  91.24
Cambridge       78.4     100.0  91.36

In [32]:
df['flag'] = df['citations'] > 99.5

In [33]:
df

           citations  employer  score   flag
MIT             99.9     100.0  99.96   True
Stanford        99.4     100.0  99.76  False
Harvard         99.9     100.0  99.96   True
Caltech        100.0      85.4  91.24   True
Cambridge       78.4     100.0  91.36  False

In [34]:
score = df.pop('score')

In [35]:
print(score)

MIT          99.96
Stanford     99.76
Harvard      99.96
Caltech      91.24
Cambridge    91.36
Name: score, dtype: float64

In [36]:
df

           citations  employer   flag
MIT             99.9     100.0   True
Stanford        99.4     100.0  False
Harvard         99.9     100.0   True
Caltech        100.0      85.4   True
Cambridge       78.4     100.0  False

In [37]:
url = 'https://raw.github.com/vincentarelbundock/Rdatasets/master/csv/DAAG/biomass.csv'

In [38]:
df = pd.read_csv(url)

In [39]:
df.head()

   Unnamed: 0  dbh     wood  bark    root  rootsk  branch       species fac26
0           1   90   5528.0   NaN   460.0     NaN     NaN   E. maculata     z
1           2  106  13650.0   NaN  1500.0   665.0     NaN  E. pilularis     2
2           3  112  11200.0   NaN  1100.0   680.0     NaN  E. pilularis     2
3           4   34   1000.0   NaN   430.0    40.0     NaN  E. pilularis     2
4           5  130      NaN   NaN  3000.0  1030.0     NaN   E. maculata     z

In [40]:
del df['Unnamed: 0']

In [41]:
df.head()

   dbh     wood  bark    root  rootsk  branch       species fac26
0   90   5528.0   NaN   460.0     NaN     NaN   E. maculata     z
1  106  13650.0   NaN  1500.0   665.0     NaN  E. pilularis     2
2  112  11200.0   NaN  1100.0   680.0     NaN  E. pilularis     2
3   34   1000.0   NaN   430.0    40.0     NaN  E. pilularis     2
4  130      NaN   NaN  3000.0  1030.0     NaN   E. maculata     z

In [42]:
df.describe()

,dbh,wood,bark,root,rootsk,branch
count,153.000000,133.000000,17.000000,54.000000,53.000000,76.000000
mean,26.352941,1569.045113,513.235294,334.383333,113.802264,54.065789
std,28.273679,4071.380720,632.467542,654.641245,247.224118,65.606369
min,3.000000,3.000000,7.000000,0.300000,0.050000,4.000000
25%,8.000000,29.000000,59.000000,11.500000,2.000000,10.750000
50%,15.000000,162.000000,328.000000,41.000000,11.000000,35.000000
75%,36.000000,1000.000000,667.000000,235.000000,45.000000,77.750000
max,145.000000,25116.000000,1808.000000,3000.000000,1030.000000,371.000000

In [43]:
print(df.mean())

dbh         26.352941
wood      1569.045113
bark       513.235294
root       334.383333
rootsk     113.802264
branch      54.065789
dtype: float64

C:\Users\ggu10\AppData\Local\Temp/ipykernel_19164/2807316344.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.mean())

In [44]:
print(df.min())

dbh                      3
wood                   3.0
bark                   7.0
root                   0.3
rootsk                0.05
branch                 4.0
species    Acacia mabellae
dtype: object

C:\Users\ggu10\AppData\Local\Temp/ipykernel_19164/3863265735.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.min())

In [45]:
print(df.max())

dbh            145
wood       25116.0
bark        1808.0
root        3000.0
rootsk      1030.0
branch       371.0
species      Other
dtype: object

C:\Users\ggu10\AppData\Local\Temp/ipykernel_19164/2376050674.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.max())

In [46]:
df.corr()

             dbh      wood      bark      root    rootsk    branch
dbh     1.000000  0.905175  0.965413  0.899301  0.934982  0.861660
wood    0.905175  1.000000  0.971700  0.988752  0.967082  0.821731
bark    0.965413  0.971700  1.000000  0.961038  0.971341  0.943383
root    0.899301  0.988752  0.961038  1.000000  0.936935  0.679760
rootsk  0.934982  0.967082  0.971341  0.936935  1.000000  0.621550
branch  0.861660  0.821731  0.943383  0.679760  0.621550  1.000000

In [47]:
print(df.isnull().any())

dbh        False
wood        True
bark        True
root        True
rootsk      True
branch      True
species    False
fac26       True
dtype: bool

In [48]:
newdf = df.dropna()

In [49]:
print(newdf.shape)

(4, 8)

In [50]:
newdf

     dbh   wood   bark  root  rootsk  branch        species fac26
123   27  550.0  105.0  44.0     9.0    59.0  B. myrtifolia     z
124   26  414.0   78.0  38.0    13.0    44.0  B. myrtifolia     z
125    9   42.0    8.0   5.0     1.3     7.0  B. myrtifolia     z
126   12   85.0   13.0  17.0     2.2    16.0  B. myrtifolia     z